load_tests/all-scenarios.yml
config:
  defaults:
    headers:
      User-Agent: Artillery
  engines:
    playwright: {}
  phases:
    - duration: 15
      arrivalRate: 1
  plugins:
    apdex: {}
  processor: "./all-scenarios.js"
scenarios:
  - engine: playwright
    testFunction: "find.transit.near.me"
  - engine: playwright
    testFunction: "plan.a.trip.from.homepage"
  - engine: playwright
    testFunction: "plan.a.trip"
  - engine: playwright
    testFunction: "search.for.a.static.page"
  - engine: playwright
    testFunction: "search.for.a.station"
  - engine: playwright
    testFunction: "search.for.a.subway.line"
  - engine: playwright
    testFunction: "view.commuter.rail.schedule"
  - engine: playwright
    testFunction: "view.subway.schedule"
  - engine: playwright
    testFunction: "visit.a.static.page"
  - engine: playwright
    testFunction: "visit.the.homepage"